<template>
    <div class="box">
      <dl>
        <dt><img :src="aboutLeft" alt="" /></dt>
        <dd>
          <h3>{{theme}}</h3>
          <p v-for="(item,index) in introList" :key="index">{{item}}</p>
        </dd>
      </dl>
    </div>
</template>
<script>
export default {
  name: 'aboutUs',
  data() {
    return {
      themes: {
        jusfoun: '公司介绍',
        gbde: '交易所介绍'
      },
      infos: {
        jusfoun: [
          '“招商通－政府招商大数据平台”，以市县招商引资工作实际业务需求为出发点，利用先进的大数据挖掘技术，着眼专业招商、精准招商，建设符合地市产业发展方向，包含全市重点产业项目、全球重点企业、科研机构、金融机构、商协会、专利技术及人员等数据内容的招商引资大数据工作平台，通过对数据进行采集、分析、计算、预测、统计、应用，丰富招商引资数据内容，实现数据寻商、数据引商、数据助商，达到数据资源实时共享、集中管理、随时查询，畅通招商引资渠道，实现招商引资工作系统化、专业化、精准化，形成全市招商引资工作“一盘棋、一张网、一体化”格局，促进招商工作转型升级创新发展。',
          '创建于2010年的九次方大数据信息集团有限公司（JUSFOUN BIG DATA) 是中国第一家大数据资产运营商，同时也是全球第一家大数据交易所：贵阳大数据交易所的创始股东，公司坚持以“贡献中国数据智慧，激活政府数据价值，构建全球数据生态”为使命，通过“三轴一中心一平台一生态”战略，构建完整的全球大数据生态链'
        ],
        gbde: [
          '贵阳大数据交易所在贵州省、贵阳市政府的支持下，于2014年12月31日注册成立，2015年4月14日正式挂牌运营，是我国乃至全球第一家大数据交易所，今年4月25日成为2017年国家大数据（贵州）综合试验区首批重点企业。2015年5月8日，国务院总理李克强亲自批示贵阳大数据交易所：希望“利用‘大数据×’，形成‘互联网+’的战略支撑。”',
          '交易所总部位于贵阳，已在北京、上海设立运营中心，并在徐州、石河子、汕头、德阳、丽江、张家口、开封、枣庄、山西、宝鸡、新乡等11个省或市设立交易服务分中心。秉承“贡献中国数据智慧、释放全球数据价值”理念，积极推动政府数据融合共享、开放应用，激活行业数据价值，志在成为全国重要的数据交易市场，打造国际一流的综合性大数据交易服务平台。',
          '通过自主开发的电子交易系统，交易所面向全球提供7×24小时永不休市的专业服务，提供完善的数据确权、数据定价、数据指数、数据交易、结算、交付、安全保障、数据资产管理等综合配套服务。按照《贵州省数字经济发展规划(2017-2020年)》统一部署，交易所不断完善经营模式与大数据交易产品体系，健全数据交易产业链服务，支撑贵州数据经济发展。',
          '截至2017年10月，交易所交易额累积突破1.2亿元，交易框架协议近3亿元，发展会员超1500家，接入225家优质数据源，可交易数据产品近4000个，可交易的数据总量超150 PB。连续三年（2015-2017）承办“数博会”核心论坛——中国（贵阳）大数据交易高峰论坛，发布《中国大数据交易产业白皮书（报告）》、《贵阳大数据交易观山湖公约》等成果，引领大数据交易产业发展。',
          '交易所参与了国家大数据产业“一规划四标准”的制定，分别是工信部《大数据产业发展规划（2016－2020年）》和全国信标委《大数据交易标准》、《大数据技术标准》、《大数据安全标准》、《大数据应用标准》。交易所于2016年5月26日成为全国信标委“大数据交易标准试点基地”，2017年3月18日荣膺“全国信标委大数据标准工作组2016年优秀单位”。',
          '自成立以来，交易所不断壮大“朋友圈”，与中国工程院院士沈昌祥合作创建我国大数据领域第一个院士工作站，联合多方共建大数据交易商（贵阳）联盟，联合贵阳、广州等50余城发起成立“中国城市大数据产业发展联盟”，联合清华、北大等20余所高校发起成立“中国大数据交易联合实验室”，与中国政法大学达成合作，与中信银行共建“金融风险大数据实验室”，经农商银行发展联盟授权而成立“全国农商银行金融风险联合实验室”，共同激活我国亿万数据资产价值。'
        ]
      }
    }
  },
  computed: {
    theme() {
      return this.themes[window.flag]
    },
    introList() {
      return this.infos[window.flag]
    },
    aboutLeft() {
      return window.about
    }
  }
}
</script>
<style scoped lang="less">
.box {
  width: 100%;
  background-color: white;
  box-shadow: 0 2px 5px 0 rgba(0, 0, 0, 0.05);
  min-height: 585px;
  dl {
    width: 100%;
    display: flex;
    padding-top: 70px;
    padding-bottom: calc(~'100vh - 746px');
    dt {
      padding: 0 80px 0 65px;
      img {
        width: 350px;
        height: 500px;
        border: 1px solid #84ccff;
        border-radius: 4px;
      }
    }
    dd {
      box-sizing: border-box;
      padding-right: 80px;
      flex: 1;
      h3 {
        font-size: 24px;
        font-weight: bold;
        margin-bottom: 30px;
        padding-bottom: 20px;
        padding-top: 5px;
        border-bottom: 1px solid #e1e1e1;
      }
      p {
        width: 100%;
        box-sizing: border-box;
        font-size: 16px;
        color: #666666;
        text-indent: 33px;
        line-height: 28px;
        margin-top: 25px;
        span {
          color: #78abff;
        }
      }
      p:first-child {
        margin-top: 0;
      }
    }
  }
}
</style>
